app/controllers/movies_controller.rb

  def index

    # Unsorted movies, initialized.
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE "rating"."PG-13" = '1'

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "director" = 'jhlhbj' WHERE "movies"."id" = 1

  def find_movies_same_director
    id = params[:id]
    @movie = Movie.find(id)
    @chosen_director = @movie.director

    if @chosen_director.nil? || @chosen_director.blank?
      flash[:notice] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      #@chosen_movies = Movie.same_director(@chosen_director)
      @chosen_movies = Movie.find_all_by_director(@chosen_director)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", #<Enumerator: ["PG-13"]:each>]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'jhlhbj'